# vim: set ft=ruby:

tap "homebrew/cask-fonts"
tap "thoughtbot/formulae"
tap "tombell/formulae"

brew "fzf"
brew "git"
brew "go"
brew "gomodifytags"
brew "gopls"
brew "lock"
brew "neovim"
brew "nodenv"
brew "rbenv"
brew "rbenv-gemset"
brew "rcm"
brew "ripgrep"
brew "skbd"
brew "stylua"
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "alacritty"
cask "appcleaner"
cask "cleanymmac"
cask "discord"
cask "doppler"
cask "font-iosevka-ss08"
cask "google-chrome"
cask "mpv"
# cask "paragon-ntfs"
cask "soundsource"
cask "spotify"
cask "stark"
cask "telegram"
cask "the-unarchiver"
