# vim: set ft=ruby:

tap "heroku/brew"

brew "git-lfs"
brew "heroku"
brew "postgresql"
brew "redis"
brew "watchman"

cask "adoptopenjdk8"
cask "android-studio"
cask "chromedriver"
cask "ngrok"
cask "paw"
cask "postico"
cask "slack"
cask "viscosity"
cask "visual-studio-code"
cask "zoom"
