# vim: set ft=ruby:
# frozen_string_literal: true

personal = 'Pyra'
work = 'Poppi'

hostname = `scutil --get ComputerName`.chomp

tap 'starkwm/formulae'
tap 'tombell/formulae'

brew 'rcm'
brew 'zsh-autosuggestions'

cask '1password'
cask '1password-cli'
cask 'appcleaner'
cask 'ghostty@tip'
cask 'keka'
cask 'kekaexternalhelper'
cask 'keyboardcleantool'
cask 'tombell/formulae/font-iosevka-custom'

if [personal, work].include?(hostname)
  brew 'difftastic'
  brew 'fd'
  brew 'fzf'
  brew 'gh'
  brew 'git'
  brew 'jj'
  brew 'jq'
  brew 'libyaml'
  brew 'mas'
  brew 'mise'
  brew 'neovim'
  brew 'ripgrep'
  brew 'starkwm/formulae/skbd'
  brew 'tmux'
  brew 'tree'
  brew 'xz'
  brew 'zoxide'

  cask 'discord'
  cask 'google-chrome'
  cask 'karabiner-elements'
  cask 'soundsource'
  cask 'starkwm/formulae/stark'
  cask 'telegram'
  cask 'tidal'

  mas 'Xcode', id: 497799835
end

if hostname == personal
  brew 'transmission-cli'

  cask 'optimus-player'
end

if hostname == work
  tap 'auth0/auth0-cli'
  tap 'heroku/brew'

  brew 'auth0/auth0-cli/auth0'
  brew 'git-lfs'
  brew 'heroku/brew/heroku'
  brew 'libffi'
  brew 'libpq'
  brew 'libxml2'
  brew 'postgresql@17'
  brew 'redis'
  brew 'stripe-mock'
  brew 'tombell/formulae/tmux-manager'

  cask 'android-studio'
  cask 'chromedriver'
  cask 'postico'
  cask 'rapidapi'
  cask 'slack'
  cask 'zulu@17'
end
