# vim: set ft=ruby:
# frozen_string_literal: true

personal = "Pyra"
work = "Haze"

hostname = `scutil --get ComputerName`.chomp

tap "starkwm/formulae"
tap "tombell/formulae"

brew "bat"
brew "fd"
brew "fzf"
brew "mole"
brew "rcm"
brew "ripgrep"
brew "starkwm/formulae/skbd"
brew "tree"
brew "zoxide"
brew "zsh-autosuggestions"

cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "ghostty@tip"
cask "keka"
cask "keyboardcleantool"

if [personal, work].include? hostname
  brew "entr"
  brew "gh"
  brew "git"
  brew "git-delta"
  brew "jj"
  brew "jq"
  brew "libyaml"
  brew "tmux"
  brew "mas"
  brew "mise"
  brew "xz"

  cask "discord"
  cask "tombell/formulae/font-iosevka-custom"
  cask "google-chrome"
  cask "karabiner-elements"
  cask "postico"
  cask "soundsource"
  cask "starkwm/formulae/stark@tip"
  cask "superwhisper"
  cask "telegram"
  cask "tidal"
  cask "virtualbuddy"
  cask "yaak"

  mas "Xcode", id: 497_799_835
end

if [personal].include? hostname
  brew "transmission-cli"
end

if [work].include? hostname
  brew "tombell/formulae/tmux-manager"
end
